In [115]:
import pandas as pd
import numpy as np

## Duplicates in Datasets

In [ ]:
students = [('Sri',    34, 'Sydeny'),
            ('Sai',    30, 'Delhi'),
            ('Anand',  16, 'Singapore'),
            ('Steve',  30, 'Delhi'),
            ('Anand',   16, 'Singapore'),
            ('Priti',    30, 'Mumbai'),
            ('Rahul', 40, 'Delhi'),
            ('Rahul', 30, 'Delhi')
            ]
 
# Create a DataFrame object
df = pd.DataFrame(students, columns=['Name', 'Age', 'City'])
df

## Find Duplicate Rows based on all columns

In [ ]:
# Select duplicate rows except first occurrence based on all columns
duplicateRowsDF = df[df.duplicated(keep='first')]

print("Duplicate Rows except first occurrence based on all columns are :")
duplicateRowsDF

In [ ]:
# Select duplicate rows except last occurrence based on all columns
duplicateRowsDF = df[df.duplicated(keep='last')]
 
print("Duplicate Rows except last occurrence based on all columns are :")
duplicateRowsDF

## Find Duplicate Rows based on selected columns

#### find & select rows based on a single column,

In [ ]:
# Select all duplicate rows based on one column
duplicateRowsDF = df[df.duplicated(['Name'], keep='first')]
duplicateRowsDF

Here rows which has same value in ‘Name’ column are marked as duplicate and returned.

#### Find & select rows based on a two column names,

In [ ]:
# Select all duplicate rows based on multiple column names in list
duplicateRowsDF = df[df.duplicated(['Age', 'City'], keep='first')]
duplicateRowsDF

Here rows which has same values in ‘Age’  & ‘City’ columns are marked as duplicate and returned.

## Dropping duplicates from a particular column

In [ ]:
students = [('Sri',    34, 'Sydeny'),
            ('Sai',    30, 'Delhi'),
            ('Anand',  16, 'Singapore'),
            ('Steve',  30, 'Delhi'),
            ('Anand',   16, 'Singapore'),
            ('Priti',    30, 'Mumbai'),
            ('Rahul', 40, 'Delhi'),
            ('Rahul', 30, 'Delhi')
            ]
 
# Create a DataFrame object
df = pd.DataFrame(students, columns=['Name', 'Age', 'City'])
df

In [ ]:
df.drop_duplicates(['Name'], keep='first', inplace=False)

In [ ]:
df.drop_duplicates(['Name', 'City'], keep='first', inplace=False)

## Basic sanity of data

In [ ]:
import sklearn
from sklearn import datasets

In [ ]:
iris = datasets.load_iris()

In [ ]:
iris.feature_names

In [ ]:
iris.data[:5]

In [ ]:
iris.target_names

In [ ]:
iris.target

In [ ]:
X = iris.data
y = iris.target

In [ ]:
np.c_[X[:5], y[:5]]

In [ ]:
data    = np.c_[X, y]
columns = ['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'class']

df      = pd.DataFrame(data=data, columns=columns)
df.head()

In [ ]:
# change the class from numeric to string for easy understanding
replacements  = {0: 'setosa', 1: 'versicolor', 2: 'virginica'}

df['class']   = df['class'].map(replacements)

In [ ]:
df.head()

In [ ]:
# find out how many samples from each class
df['class'].value_counts()

In [ ]:
# basic statistics
# check for min, max, quartiles, IQR
df.describe()

In [ ]:
df[['sepal_length', 'petal_length']].describe()

In [ ]:
# locate by index position
df.loc[[0, 56]]

In [ ]:
df.loc[df['class'] == 'setosa']

In [ ]:
# display selected columns for class = 'setosa'
df.loc[df['class'] == 'setosa', ['petal_width', 'petal_length']]

In [ ]:
# display mean values of selected columns for class = 'setosa'
df.loc[df['class'] == 'setosa', ['petal_width', 'petal_length']].mean()

In [ ]:
# display max values of selected columns for class = 'setosa'
df.loc[df['class'] == 'setosa', ['petal_width', 'petal_length']].max()

In [ ]:
# use of grouping
groups = df.groupby('class')

In [ ]:
# use sum(), min(), max(), count()
groups.mean()

In [ ]:
groups.agg(['mean', 'min', 'max', 'count'])

## numeric col containing non-numeric data

In [ ]:
d = {
 'unit': ['UD', 'UD', 'UD', 'UD', 'ud','uD'],
 'N-D':  [ 'Q1', 'Q2', 'Q3', 'Q4','Q5','Q6'],
 'num' : [ -1.48, 1.7, -6.18, 0.25, 'weird', 0.25]

}

df = pd.DataFrame(d)
df

In [ ]:
df['num'].str.isnumeric()

In [ ]:
df['num'].str.isdecimal()

## check for character cases

In [ ]:
df['unit'].str.isupper()

In [ ]:
df['unit'] = df['unit'].str.upper()

In [ ]:
df

## Handling missing values

In [116]:
location = r"data\nba.csv"

In [117]:
# making data frame from csv file 
nba = pd.read_csv(location)

In [118]:
nba.shape

(457, 9)

In [119]:
nba.head(10)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0

In [120]:
# are there nulls?
nba.isnull().sum()

Name         0
Team         0
Number       0
Position     0
Age          0
Height       0
Weight       0
College     84
Salary      11
dtype: int64

example #1 - Replacing NaN values with a Static value.

In [121]:
# replacing na values in college with No college 
nba["College"].fillna("MIT", inplace = True) 

nba.isnull().sum()
#nba['College'].isnull().sum()

Name         0
Team         0
Number       0
Position     0
Age          0
Height       0
Weight       0
College      0
Salary      11
dtype: int64

Example #2: Using method Parameter

In [ ]:
# making data frame from csv file 
nba = pd.read_csv(location) 
nba.head(10)

In [ ]:
# making data frame from csv file 
nba = pd.read_csv(location) 
  
# replacing na values in college with No college 
nba["College"].fillna( method ='ffill', inplace = True) 
  
nba.head(10)

Similarly, bfill (backfill) method can also be used.

Example #3: Using mean value

In [ ]:
# making data frame from csv file 
nba = pd.read_csv(location)

In [ ]:
nba.isnull().sum()

In [ ]:
# Or, depending on your needs:
nba['Salary'] = nba['Salary'].fillna(nba['Salary'].mean())
nba['Salary'] = nba['Salary'].fillna(nba['Salary'].min())
nba['Salary'] = nba['Salary'].fillna(nba['Salary'].max())

In [ ]:
nba.isnull().sum()

In [ ]:
np.set_printoptions(suppress=True)

In [ ]:
nba.Salary.sample(15)

In [ ]:
nba['Age'] = nba['Age'].fillna(200)

In [ ]:
nba[nba['Age']==200]

In [127]:
raw_data = {'first_name': ['Jason', np.nan, 'Tina', 'Jake', 'Amy'], 
            'last_name': ['Miller', np.nan, 'Ali', 'Milner', 'Cooze'], 
            'age': [42, np.nan, 36, 24, 73], 
            'sex': ['m', np.nan, 'f', 'm', 'f'], 
            'preTestScore': [4, np.nan, np.nan, 2, 3],
            'postTestScore': [np.nan, np.nan, np.nan, np.nan, np.nan]}

df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'sex', 'preTestScore', 'postTestScore'])
df

  first_name last_name   age  sex  preTestScore  postTestScore
0      Jason    Miller  42.0    m           4.0            NaN
1        NaN       NaN   NaN  NaN           NaN            NaN
2       Tina       Ali  36.0    f           NaN            NaN
3       Jake    Milner  24.0    m           2.0            NaN
4        Amy     Cooze  73.0    f           3.0            NaN

In [123]:
# Drop missing observations
# rows returned after dropping, the original df remains intact
df_no_missing = df.dropna()
df_no_missing

  first_name last_name   age sex  preTestScore  postTestScore
0      Jason    Miller  42.0   m           4.0           25.0
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0

In [ ]:
df

In [124]:
#Drop rows where all cells in that row is NA
df_cleaned = df.dropna(how='all')
df_cleaned

  first_name last_name   age sex  preTestScore  postTestScore
0      Jason    Miller  42.0   m           4.0           25.0
2       Tina       Ali  36.0   f           NaN            NaN
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0

In [ ]:
# Create a new column full of missing values
df['location'] = np.nan
df

In [128]:
# Drop column if they only contain missing values
df.dropna(axis=1, how='all')

  first_name last_name   age  sex  preTestScore
0      Jason    Miller  42.0    m           4.0
1        NaN       NaN   NaN  NaN           NaN
2       Tina       Ali  36.0    f           NaN
3       Jake    Milner  24.0    m           2.0
4        Amy     Cooze  73.0    f           3.0

In [ ]:
# Drop rows that contain less than five observations
# This is really mostly useful for time series
df

In [125]:
df.dropna(thresh=5)

  first_name last_name   age sex  preTestScore  postTestScore
0      Jason    Miller  42.0   m           4.0           25.0
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0

In [ ]:
# Fill in missing data with zeros
df.fillna(0)

In [ ]:
# Fill in missing in preTestScore with the mean value of preTestScore
# inplace=True means that the changes are saved to the df right away

In [ ]:
df["preTestScore"].fillna(df["preTestScore"].mean(), inplace=True)
df

In [ ]:
# Fill in missing in postTestScore with each sex’s mean value of postTestScore
df["postTestScore"].fillna(df.groupby("sex")["postTestScore"].transform("mean"), inplace=True)
df

## HOME WORK : Using scikit learn imputer

strategy : string, optional (default=”mean”)
The imputation strategy.

- If “mean”, then replace missing values using the mean along each column. Can only be used with numeric data.
- If “median”, then replace missing values using the median along each column. Can only be used with numeric data.
- If “most_frequent”, then replace missing using the most frequent value along each column. Can be used with strings or numeric data.
- If “constant”, then replace missing values with fill_value. Can be used with strings or numeric data.

In [ ]:
#from sklearn.impute import SimpleImputer
from sklearn.preprocessing import Imputer

df = pd.DataFrame([[10,     20],
                   [np.nan, 23],
                   [15,    np.nan],
                   [17,    29]])

df.dtypes

In [ ]:
imp = SimpleImputer(strategy="median")

print(imp.fit_transform(df))

one more example ...

In [ ]:
X = np.array([[23.56],
              [53.45],
              ['NaN'],
              [44.44],
              [77.78],
              ['NaN'],
              [234.44],
              [11.33],
              [79.87]])

In [ ]:
imputer = SimpleImputer(strategy='mean')  

imputer.fit_transform(X)

one more example ..

In [ ]:
# Create an empty dataset
df = pd.DataFrame()

# Create two variables called x0 and x1. Make the first value of x1 a missing value
df['x0'] = [0.3051,0.4949,0.6974,0.3769,0.2231,0.341,0.4436,0.5897,0.6308,0.5]
df['x1'] = [np.nan,0.2654,0.2615,0.5846,0.4615,0.8308,0.4962,0.3269,0.5346,0.6731]

# View the dataset
df

In [ ]:
# Fit Imputer
# Create an imputer object that looks for 'Nan' values, then replaces them with the mean value of the feature by columns (axis=0)
mean_imputer = Imputer(missing_values='NaN', strategy='mean', axis=0)

# Train the imputor on the df dataset
mean_imputer = mean_imputer.fit(df)

In [ ]:
# Apply Imputer
# Apply the imputer to the df dataset
imputed_df = mean_imputer.transform(df.values)

In [ ]:
imputed_df

Notice that 0.49273333 is the imputed value, replacing the np.NaN value.